app/Views/layout/navbar.php

                            $authData = session()->get('auth_data');
                            $unitKerja = 'Terbatas'; // Default untuk Superadmin
                            if ($authData) {
                                if (!empty($authData['id_es3'])) $unitKerja = (new \App\Models\UnitKerjaEs3Model())->find($authData['id_es3'])['nama_es3'] ?? 'N/A';
                                elseif (!empty($authData['id_es2'])) $unitKerja = (new \App\Models\UnitKerjaEs2Model())->find($authData['id_es2'])['nama_es2'] ?? 'N/A';
---
SELECT *
FROM `unit_kerja_es3`
WHERE `unit_kerja_es3`.`id` = '29'
SELECT *
FROM `unit_kerja_es2`
WHERE `unit_kerja_es2`.`id` = '71'