app/Controllers/Auth.php

UPDATE `users` SET `nip` = '199503172019021001', `name` = 'Achmad Mubarok', `email` = 'Achmad.Mubarok@bpkp.go.id', `api_token` = 'i23QlFS3rf8bYlBagIgoPxvwUP2JLfI2XedeUMbrUDB92lut8HkvbEcgEF7aXRtC', `nama_jabatan_api` = 'Arsiparis Terampil - Biro Umum dan Pengadaan Barang/Jasa', `status` = 'aktif', `updated_at` = '2025-10-29 03:57:40'
WHERE `users`.`id` IN ('187')
---
            $localUserId = $localUser['id'];

            // Kita hanya update field yang datang dari API (NIP, email, token, jabatan API)
            if ($this->userModel->update($localUserId, $userPayload) === false) {

SELECT *
FROM `users`
WHERE `users`.`id` = '187'
---
        }

        // Ambil data user lengkap yang sudah di CREATE/UPDATE
        $updatedUser = $this->userModel->find($localUserId);