app/Controllers/Auth.php

UPDATE `users` SET `nip` = '199503172019021001', `name` = 'Achmad Mubarok', `email` = 'Achmad.Mubarok@bpkp.go.id', `api_token` = '1VwkkB22cOjVF0wRcLUl9JMYJmvxhD0IgT5guWgsUBCEPmQBpgzQe9Yt47vlTGqc', `nama_jabatan_api` = 'Arsiparis Terampil - Biro Umum dan Pengadaan Barang/Jasa', `status` = 'aktif', `updated_at` = '2025-11-20 09:13:37'
WHERE `users`.`id` IN ('187')
---
                // Update existing user
                $localUserId = $localUser['id'];

                if (!$this->userModel->update($localUserId, $userPayload)) {

SELECT *
FROM `users`
WHERE `users`.`id` = '187'
---
            }

            // Fetch updated user data
            $updatedUser = $this->userModel->find($localUserId);