app/Controllers/Dashboard.php

SELECT COUNT(*) AS `numrows`
FROM `item_aktif`
SELECT COUNT(*) AS `numrows`
FROM `item_aktif`
WHERE `id_berkas` IS NOT NULL
SELECT COUNT(*) AS `numrows`
FROM `item_inaktif`
SELECT COUNT(*) AS `numrows`
FROM `item_inaktif`
WHERE `id_berkas` IS NOT NULL
SELECT `es2`.`nama_es2`, COUNT(item.id) as jumlah_item_aktif
FROM `unit_kerja_es2` as `es2`
LEFT JOIN `item_aktif` as `item` ON `item`.`id_es2` = `es2`.`id`
GROUP BY `es2`.`id`
ORDER BY `es2`.`nama_es2` ASC
SELECT COUNT(*) AS `numrows`
FROM `berkas_aktif`
SELECT COUNT(*) AS `numrows`
FROM `berkas_inaktif`
SELECT COUNT(*) AS `numrows`
FROM `klasifikasi`
SELECT COUNT(*) AS `numrows`
FROM `jenis_naskah`
SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `unit_kerja_es1`
SELECT COUNT(*) AS `numrows`
FROM `unit_kerja_es2`
SELECT COUNT(*) AS `numrows`
FROM `unit_kerja_es3`
---
    private function getSuperadminDashboardData()
    {
        $db = \Config\Database::connect();

        $itemAktifModel    = new ItemAktifModel();
        $itemInaktifModel  = new ItemInaktifModel();

        $total_item_aktif       = $itemAktifModel->countAllResults();
        $item_diberkaskan_aktif = $itemAktifModel->where('id_berkas IS NOT NULL')->countAllResults();
        $persentase_aktif       = ($total_item_aktif > 0) ? ($item_diberkaskan_aktif / $total_item_aktif) * 100 : 0;

        $total_item_inaktif       = $itemInaktifModel->countAllResults();
        $item_diberkaskan_inaktif = $itemInaktifModel->where('id_berkas IS NOT NULL')->countAllResults();
        $persentase_inaktif       = ($total_item_inaktif > 0) ? ($item_diberkaskan_inaktif / $total_item_inaktif) * 100 : 0;

        $rekap_per_es2 = $db->table('unit_kerja_es2 as es2')
            ->select('es2.nama_es2, COUNT(item.id) as jumlah_item_aktif')
            ->join('item_aktif as item', 'item.id_es2 = es2.id', 'left')
            ->groupBy('es2.id')
            ->orderBy('es2.nama_es2', 'ASC')
            ->get()->getResultArray();

        $pemindahanData = $this->getPemindahanDashboardData(null);

        return array_merge([
            'total_item_aktif'      => $total_item_aktif,
            'total_berkas_aktif'    => (new BerkasAktifModel())->countAllResults(),
            'persentase_aktif'      => round($persentase_aktif),
            'total_item_inaktif'    => $total_item_inaktif,
            'total_berkas_inaktif'  => (new BerkasInaktifModel())->countAllResults(),
            'persentase_inaktif'    => round($persentase_inaktif),
            'total_klasifikasi'     => (new KlasifikasiModel())->countAllResults(),
            'total_jenis_naskah'    => (new JenisNaskahModel())->countAllResults(),
            'total_users'           => (new UserModel())->countAllResults(),
            'total_es1'             => (new UnitKerjaEs1Model())->countAllResults(),
            'total_es2'             => (new UnitKerjaEs2Model())->countAllResults(),
            'total_es3'             => (new UnitKerjaEs3Model())->countAllResults(),

SELECT COUNT(*) AS `numrows`
FROM `item_aktif`
WHERE `id_es2` = '71'
AND `status_pindah` = 'ditolak'
SELECT COUNT(*) AS `numrows`
FROM `item_aktif`
WHERE `id_es2` = '71'
AND `status_pindah` IN ('verifikasi','ba')
---
    private function getPemindahanDashboardData($userId = null, $es2Id = null)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('item_aktif');

        if ($userId) $builder->where('id_user', $userId);
        if ($es2Id) $builder->where('id_es2', $es2Id);

        return [
            'jumlah_usulan'      => (clone $builder)->where('status_pindah', 'usul_pindah')->countAllResults(),
            'jumlah_ditolak'     => (clone $builder)->where('status_pindah', 'ditolak')->countAllResults(),
            'jumlah_diproses'    => (clone $builder)->whereIn('status_pindah', ['verifikasi', 'ba'])->countAllResults(),

SELECT *
FROM `unit_kerja_es2`
WHERE `unit_kerja_es2`.`id` = '71'
SELECT COUNT(*) AS `numrows`
FROM `item_aktif`
WHERE `id_es2` = '71'
SELECT COUNT(*) AS `numrows`
FROM `item_aktif`
WHERE `id_es2` = '71'
AND `id_berkas` IS NOT NULL
SELECT COUNT(*) AS `numrows`
FROM `item_inaktif`
WHERE `id_es2` = '71'
SELECT COUNT(*) AS `numrows`
FROM `item_inaktif`
WHERE `id_es2` = '71'
AND `id_berkas` IS NOT NULL
SELECT COUNT(*) AS `numrows`
FROM `berkas_aktif`
WHERE `id_es2` = '71'
SELECT COUNT(*) AS `numrows`
FROM `berkas_inaktif`
WHERE `id_es2` = '71'
SELECT `es3`.`nama_es3`, COUNT(DISTINCT ia.id) as jumlah_item_aktif, COUNT(DISTINCT ii.id) as jumlah_item_inaktif
FROM `unit_kerja_es3` as `es3`
LEFT JOIN `item_aktif` as `ia` ON `ia`.`id_es3` = `es3`.`id`
LEFT JOIN `item_inaktif` as `ii` ON `ii`.`id_es3` = `es3`.`id`
WHERE `es3`.`id_es2` = '71'
GROUP BY `es3`.`id`, `es3`.`nama_es3`
ORDER BY `es3`.`nama_es3` ASC
---
    private function getAdminDashboardData()
    {
        $session = session();
        $authData = $session->get('auth_data');

        if (empty($authData) || empty($authData['id_es2'])) {
            return ['nama_es2_admin' => 'Hak Akses Belum Diatur', 'data_kosong' => true];
        }

        $id_es2_admin = $authData['id_es2'];
        $db = \Config\Database::connect();

        $unitKerjaEs2Model = new UnitKerjaEs2Model();
        $itemAktifModel    = new ItemAktifModel();
        $itemInaktifModel  = new ItemInaktifModel();
        $berkasAktifModel  = new BerkasAktifModel();
        $berkasInaktifModel = new BerkasInaktifModel();
        $nilaiPengawasanModel = new NilaiPengawasanModel();

        $nama_es2_admin = $unitKerjaEs2Model->find($id_es2_admin)['nama_es2'] ?? 'Unit Tidak Ditemukan';

        // Aktif
        $total_item_aktif = $itemAktifModel->where('id_es2', $id_es2_admin)->countAllResults();
        $item_diberkaskan_aktif = $itemAktifModel->where('id_es2', $id_es2_admin)->where('id_berkas IS NOT NULL')->countAllResults();
        $persentase_aktif = ($total_item_aktif > 0) ? ($item_diberkaskan_aktif / $total_item_aktif) * 100 : 0;

        // Inaktif
        $total_item_inaktif = $itemInaktifModel->where('id_es2', $id_es2_admin)->countAllResults();
        $item_diberkaskan_inaktif = $itemInaktifModel->where('id_es2', $id_es2_admin)->where('id_berkas IS NOT NULL')->countAllResults();
        $persentase_inaktif = ($total_item_inaktif > 0) ? ($item_diberkaskan_inaktif / $total_item_inaktif) * 100 : 0;

        // Berkas
        $total_berkas_aktif = $berkasAktifModel->where('id_es2', $id_es2_admin)->countAllResults();
        $total_berkas_inaktif = $berkasInaktifModel->where('id_es2', $id_es2_admin)->countAllResults();

        $rekap_per_es3 = $db->table('unit_kerja_es3 as es3')
            ->select('
                es3.nama_es3,
                COUNT(DISTINCT ia.id) as jumlah_item_aktif,
                COUNT(DISTINCT ii.id) as jumlah_item_inaktif
            ')
            ->join('item_aktif as ia', 'ia.id_es3 = es3.id', 'left')
            ->join('item_inaktif as ii', 'ii.id_es3 = es3.id', 'left')
            ->where('es3.id_es2', $id_es2_admin)
            ->groupBy('es3.id, es3.nama_es3')
            ->orderBy('es3.nama_es3', 'ASC')
            ->get()->getResultArray();

SELECT *
FROM `unit_kerja_es3`
WHERE `unit_kerja_es3`.`id` = '29'
SELECT *
FROM `unit_kerja_es2`
WHERE `unit_kerja_es2`.`id` = '67'
---
    private function getUserDashboardData($userId)
    {
        $session         = session();
        $authData        = $session->get('auth_data') ?? [];
        $isConfigured    = $session->get('is_configured');
        $id_es3_filter   = null;
        $namaUnitKerja   = 'Belum Terkonfigurasi';
        $kodeEs2         = '-';
        $namaEs2         = '-';

        $itemAktifModel   = new ItemAktifModel();
        $berkasAktifModel = new BerkasAktifModel();
        $itemInaktifModel = new ItemInaktifModel();
        $berkasInaktifModel = new BerkasInaktifModel();
        $unitKerjaEs3Model = new UnitKerjaEs3Model();
        $unitKerjaEs2Model = new UnitKerjaEs2Model();

        if (!$isConfigured || empty($authData['id_es3'] ?? null)) {
            return [
                'nama_unit_kerja'          => $namaUnitKerja,
                'data_kosong'              => true,
                'total_item_aktif_user'    => 0,
            ];
        }

        $id_es3_filter = $authData['id_es3'];
        $unitEs3 = $unitKerjaEs3Model->find($id_es3_filter);

        if ($unitEs3) {
            $namaUnitKerja = $unitEs3['nama_es3'];
            $unitEs2 = $unitKerjaEs2Model->find($unitEs3['id_es2']);

SELECT COUNT(*) AS `numrows`
FROM `item_aktif`
WHERE `id_es3` = '29'
SELECT COUNT(*) AS `numrows`
FROM `item_aktif`
WHERE `id_es3` = '29'
AND `id_berkas` IS NOT NULL
SELECT COUNT(*) AS `numrows`
FROM `berkas_aktif`
WHERE `id_es3` = '29'
SELECT COUNT(*) AS `numrows`
FROM `item_inaktif`
WHERE `id_es3` = '29'
SELECT COUNT(*) AS `numrows`
FROM `item_inaktif`
WHERE `id_es3` = '29'
AND `id_berkas` IS NOT NULL
SELECT COUNT(*) AS `numrows`
FROM `berkas_inaktif`
WHERE `id_es3` = '29'
---
            $namaEs2 = $unitEs2['nama_es2'] ?? '-';
        }

        $totalItemAktifUser = $itemAktifModel->where('id_es3', $id_es3_filter)->countAllResults();
        $itemDiberkaskanAktifUser = $itemAktifModel->where('id_es3', $id_es3_filter)->where('id_berkas IS NOT NULL')->countAllResults();
        $persentaseAktif = ($totalItemAktifUser > 0) ? ($itemDiberkaskanAktifUser / $totalItemAktifUser) * 100 : 0;
        $totalBerkasAktifUser = $berkasAktifModel->where('id_es3', $id_es3_filter)->countAllResults();

        $totalItemInaktifUser = $itemInaktifModel->where('id_es3', $id_es3_filter)->countAllResults();
        $itemDiberkaskanInaktifUser = $itemInaktifModel->where('id_es3', $id_es3_filter)->where('id_berkas IS NOT NULL')->countAllResults();
        $persentaseInaktif = ($totalItemInaktifUser > 0) ? ($itemDiberkaskanInaktifUser / $totalItemInaktifUser) * 100 : 0;
        $totalBerkasInaktifUser = $berkasInaktifModel->where('id_es3', $id_es3_filter)->countAllResults();

SELECT MONTH(tgl_dokumen) as month, COUNT(id) as count
FROM `item_aktif`
WHERE `id_es3` = 29
AND YEAR(tgl_dokumen) = '2025'
GROUP BY `month`
ORDER BY `month` ASC
---
    private function getMonthlyInputData(?int $userId, ?int $idEs3Filter)
    {
        $currentYear = date('Y');

        if (is_null($idEs3Filter) || $idEs3Filter === 0) {
            return [
                'months'       => array_map(fn($m) => date("M", mktime(0, 0, 0, $m, 1)), range(1, 12)),
                'counts'       => array_fill(0, 12, 0),
                'current_year' => $currentYear,
            ];
        }

        $db = \Config\Database::connect();
        $rawQuery = $db->table('item_aktif')
            ->select("MONTH(tgl_dokumen) as month, COUNT(id) as count")
            ->where('id_es3', $idEs3Filter)
            ->where('YEAR(tgl_dokumen)', $currentYear)
            ->groupBy('month')
            ->orderBy('month', 'ASC')
            ->get()->getResultArray();