app/Controllers/Laporan.php

SELECT *
FROM `unit_kerja_es3`
WHERE `unit_kerja_es3`.`id` = '29'
---
            $id_es2_tampil = $authData['id_es2'] ?? null;

            if ($userRole === 'user' && !empty($authData['id_es3'])) {
                $es3 = $this->unitKerjaEs3Model->find($authData['id_es3']);

SELECT *
FROM `unit_kerja_es2`
WHERE `unit_kerja_es2`.`id` = '67'
---
            }

            if ($id_es2_tampil) {
                $nama_es2 = $this->unitKerjaEs2Model->find($id_es2_tampil)['nama_es2'] ?? 'Unit Tidak Dikenal';

SELECT *
FROM `unit_kerja_es2`
ORDER BY `nama_es2` ASC
---
    public function index()
    {
        $report = $this->getLaporanData();
        $data = [
            'title'         => 'Laporan Arsip Aktif',
            'laporanData'   => $report['laporanData'],
            'nama_es2'      => $report['nama_es2'],
            'tanggal_mulai' => $this->request->getGet('tanggal_mulai'),
            'tanggal_akhir' => $this->request->getGet('tanggal_akhir'),
            // --- TAMBAHAN BARU: Kirim opsi Es2 untuk filter ---
            'es2_filter_options' => $this->unitKerjaEs2Model->orderBy('nama_es2', 'ASC')->findAll(),