app/Controllers/Pemindahan.php

SELECT COUNT(*) AS `numrows`
FROM `item_aktif`
SELECT COUNT(*) AS `numrows`
FROM `item_inaktif`
SELECT COUNT(*) AS `numrows`
FROM `item_aktif`
WHERE `status_pindah` IN ('menunggu_verif1','disetujui_verif1','disetujui_verif2','menunggu_eksekusi')
SELECT COUNT(*) AS `numrows`
FROM `item_aktif`
WHERE `status_pindah` = 'menunggu_verif1'
SELECT COUNT(*) AS `numrows`
FROM `item_aktif`
WHERE `status_pindah` = 'disetujui_verif1'
SELECT COUNT(*) AS `numrows`
FROM `item_aktif`
WHERE `status_pindah` = 'disetujui_verif2'
SELECT COUNT(*) AS `numrows`
FROM `item_aktif`
WHERE `status_pindah` = 'disetujui_verif3'
SELECT COUNT(*) AS `numrows`
FROM `item_aktif`
WHERE `status_pindah` = 'menunggu_eksekusi'
SELECT COUNT(*) AS `numrows`
FROM `item_aktif`
WHERE `status_pindah` = 'ditolak_verif1'
SELECT COUNT(*) AS `numrows`
FROM `item_aktif`
WHERE `status_pindah` = 'ditolak_verif2'
SELECT COUNT(*) AS `numrows`
FROM `item_aktif`
WHERE `status_pindah` = 'ditolak_verif3'
SELECT COUNT(*) AS `numrows`
FROM `item_aktif`
WHERE `status_pindah` IN ('ditolak_verif1','ditolak_verif2','ditolak_verif3')
SELECT COUNT(*) AS `numrows`
FROM `berita_acara`
SELECT `unit_kerja_es2`.`nama_es2`, COUNT(item_inaktif.id) as total_items_moved
FROM `item_inaktif`
LEFT JOIN `unit_kerja_es2` ON `unit_kerja_es2`.`id` = `item_inaktif`.`id_es2`
WHERE `item_inaktif`.`status_pindah` = 'dipindahkan'
GROUP BY `unit_kerja_es2`.`nama_es2`
---
    public function dashboard()
    {
        if (!$this->session->get('isLoggedIn')) {
            session()->setFlashdata('error', 'Anda harus login untuk mengakses halaman ini.');
            return redirect()->to('/login');
        }

        $data['counts'] = [];
        $data['counts']['total_arsip_aktif'] = $this->itemAktifModel->countAllResults();
        $data['counts']['total_arsip_inaktif'] = $this->itemInaktifModel->countAllResults();
        $data['counts']['total_menunggu_verifikasi'] = $this->itemAktifModel
            ->whereIn('status_pindah', ['menunggu_verif1', 'disetujui_verif1', 'disetujui_verif2', 'menunggu_eksekusi'])
            ->countAllResults();
        $data['counts']['usulan_baru'] = $this->itemAktifModel->where('status_pindah', 'menunggu_verif1')->countAllResults();
        $data['counts']['verifikasi1_menunggu'] = $this->itemAktifModel->where('status_pindah', 'menunggu_verif1')->countAllResults();
        $data['counts']['verifikasi2_menunggu'] = $this->itemAktifModel->where('status_pindah', 'disetujui_verif1')->countAllResults();
        $data['counts']['verifikasi3_menunggu'] = $this->itemAktifModel->where('status_pindah', 'disetujui_verif2')->countAllResults();
        $data['counts']['buatba_menunggu'] = $this->itemAktifModel->where('status_pindah', 'disetujui_verif3')->countAllResults();
        $data['counts']['eksekusi_menunggu'] = $this->itemAktifModel->where('status_pindah', 'menunggu_eksekusi')->countAllResults();
        $data['counts']['ditolak_verif1'] = $this->itemAktifModel->where('status_pindah', 'ditolak_verif1')->countAllResults();
        $data['counts']['ditolak_verif2'] = $this->itemAktifModel->where('status_pindah', 'ditolak_verif2')->countAllResults();
        $data['counts']['ditolak_verif3'] = $this->itemAktifModel->where('status_pindah', 'ditolak_verif3')->countAllResults();
        $data['counts']['total_ditolak'] = $this->itemAktifModel
            ->whereIn('status_pindah', ['ditolak_verif1', 'ditolak_verif2', 'ditolak_verif3'])
            ->countAllResults();
        $data['counts']['total_berita_acara'] = $this->beritaAcaraModel->countAllResults();
        $data['counts']['pemindahan_per_es2'] = $this->itemInaktifModel
            ->select('unit_kerja_es2.nama_es2, COUNT(item_inaktif.id) as total_items_moved')
            ->join('unit_kerja_es2', 'unit_kerja_es2.id = item_inaktif.id_es2', 'left')
            ->where('item_inaktif.status_pindah', 'dipindahkan')
            ->groupBy('unit_kerja_es2.nama_es2')
            ->findAll();