app/Models/HakFiturModel.php

    public function getHakFiturByUserId(int $userId)
    {
        // Menggunakan where dan first() untuk mencari satu baris berdasarkan id_user
        return $this->where('id_user', $userId)->first();
---
SELECT *
FROM `hak_fitur`
WHERE `id_user` = 187
 LIMIT 1