app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `name` = 'Achmad Mubarok'
AND `status` = 'aktif'
 LIMIT 1
---
    public function getUserByMappedName(string $name)
    {
        // Mencari user berdasarkan field 'name' yang menjadi kunci mapping
        return $this->where('name', $name)
            ->where('status', 'aktif')
            ->first();